; domain
(define (domain PAN)
  (:requirements :strips)
  (:requirements :adl)
  (:requirements :strips :disjunctive-preconditions)
  (:requirements :strips :equality :typing :conditional-effects)  
  (:requirements [:strips] [:equality] [:typing] [:adl])
  (:predicates  
           (ontable ?x)
	       (onpan ?x)
	       (onpan_oil ?x)
	       (onpan_oil_spice ?x)
	       (onpan_oil_spice_salt ?x)
	       
	       (readytoadd)
	       (cooking ?x)
	       )
	       


(:action put-on-pan
	     :parameters (?x)
	     :precondition  (and (cooking ?x) (not(onpan ?x)))
	   
	     :effect
	     (and (not (cooking ?x))
		   
		   (readytoadd)
		   (onpan ?x) )
		   
		   )

(:action ready-to-add-on
	     :parameters (?x)
	     :precondition  (and (readytoadd) (or (onpan ?x) (onpan_oil ?x) (onpan_oil_spice ?x) (onpan_oil_spice_salt ?x)(ontable ?x) ) )  
	     :effect
	    (and 
		 (not (readytoadd)) (not(onpan_oil ?x))(not(ontable ?x)) (not(onpan ?x))(not(onpan_oil_spice ?x)) (not(onpan_oil_spice_salt ?x))
		   (cooking ?x)))	       
  
		   
		   


(:action add-on-oil
	     :parameters (?x)
	     :precondition (and(cooking ?x) (not(onpan_oil ?x)))
	     :effect
	     (and (not (cooking ?x))
		   
		   (readytoadd)
		   (onpan_oil ?x) )
		   
		   )
		   
(:action add-on-oil-spice
	     :parameters (?x)
	     :precondition (and(cooking ?x) (not(onpan_oil_spice ?x)) )
	     :effect
	     (and (not (cooking ?x))
		   
		   (readytoadd)
		   (onpan_oil_spice ?x))
		   
		   )
(:action add-on-oil-spice-salt
	     :parameters (?x)
	     :precondition (and(cooking ?x) (not(onpan_oil_spice_salt ?x)) )
	     :effect
	     (and (not (cooking ?x))
		   
		   (readytoadd)
		   (onpan_oil_spice_salt ?x))
		   
		   )

		   )

; problem
(define (problem FOOD)
(:domain PAN)
(:objects OIL SPICE SALT MEAT )
(:INIT (ONTABLE OIL) (ONTABLE SPICE) (ONTABLE SALT) (ONTABLE MEAT) (readytoadd))
(:goal (AND (ONPAN OIL) (ONPAN_OIL SPICE) (ONPAN_OIL_SPICE SALT) (ONPAN_OIL_SPICE_SALT MEAT) ) )
)

; plan
1. (ready-to-add-on oil)
   deleted: (readytoadd) (ontable oil)
   added: (cooking oil)
   goals met: 0 of 4
2. (put-on-pan oil)
   deleted: (cooking oil)
   added: (readytoadd) (onpan oil)
   goals met: 1 of 4
3. (ready-to-add-on spice)
   deleted: (readytoadd) (ontable spice)
   added: (cooking spice)
   goals met: 1 of 4
4. (add-on-oil spice)
   deleted: (cooking spice)
   added: (readytoadd) (onpan_oil spice)
   goals met: 2 of 4
5. (ready-to-add-on salt)
   deleted: (readytoadd) (ontable salt)
   added: (cooking salt)
   goals met: 2 of 4
6. (add-on-oil-spice salt)
   deleted: (cooking salt)
   added: (readytoadd) (onpan_oil_spice salt)
   goals met: 3 of 4
7. (ready-to-add-on meat)
   deleted: (readytoadd) (ontable meat)
   added: (cooking meat)
   goals met: 3 of 4
8. (add-on-oil-spice-salt meat)
   deleted: (cooking meat)
   added: (readytoadd) (onpan_oil_spice_salt meat)
   goals met: 4 of 4
